<?php

namespace Database\Seeders;

use App\Models\AddressSeeder as ModelsAddressSeeder;
use Illuminate\Database\Seeder;

class AddressSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $addresses = [
            'თბილისი' => [
                'ვაკე/საბურთალო' => [
                    'ბაგები',
                    'დიდი დიღომი',
                    'დიღომი 1-9',
                    'ვაკე',
                    'ვაშლიჯვარი',
                    'ვეძისი',
                    'თხინვალი',
                    'კუს ტბა',
                    'ლისის ტბა',
                    'ნუცუბიძის ფერდობი',
                    'საბურთალო',
                    'სოფ. დიღომი',
                    'ვაჟა ფშაველას კვარტლები
                    ',
                ],
                'ისანი-სამგორი' => [
                    'აეროპორტის დას.',
                    'დამპალოს დას.',
                    'ვაზისუბანი',
                    'ვარკეთილი',
                    'ისანი',
                    'ლილო',
                    'მესამე მასივი',
                    'ნავთლუღი',
                    'ორთაჭალა',
                    'ორხევი',
                    'სამგორი',
                    'ფონიჭალა',
                    'აეროპორტის გზატ.',
                    'აფრიკის დას'
                ],
                'გლდანი-ნაძალადევი' => [
                    'ავჭალა',
                    'გლდანი',
                    'გლდანულა',
                    'ზაჰესი',
                    'თბილისის ზღვა',
                    'თემქა',
                    'ივერთუბანი',
                    'კონიაკის დას.',
                    'ლოტკინი',
                    'მუხიანი',
                    'ნაძალადევი',
                    'სანზონა',
                    'სოფ. გლდანი'
                ],
                'დიდუბე-ჩუღურეთი' => [
                    'დიდუბე',
                    'დიღმის მასივი',
                    'კუკია',
                    'სვანეთის უბანი',
                    'ჩუღურეთი'
                ],
                'ძველი თბილისი' => [
                    'აბანოთუბანი',
                    'ავლაბარი',
                    'ელია',
                    'ვერა',
                    'მთაწმინდა',
                    'სოლოლაკი'
                ]
            ],
        ];

        foreach($addresses as $city => $districts) {
            foreach($districts as $district => $streets) {
                foreach($streets as $street) {
                    ModelsAddressSeeder::create([
                        'city' => $city,
                        'district' => $district,
                        'street' => $street
                    ]);
                }
            }
                
        }
    }
}
