<?php

namespace Database\Seeders;

use App\Models\JobSeeder as ModelsJobSeeder;
use Illuminate\Database\Seeder;

class JobSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $jobs = [
            'TOP მენეჯმენტი',
            'ადამიანური რესურსები',
            'ადმინისტრაცია',
            'ავიაცია/აეროპორტი',
            'ავტო-მოტო სერვისი',
            'არასამთავრობო (NGO)',
            'ბუღალტერია/ფინანსები',
            'გაყიდვები',
            'დაზღვევა',
            'დასუფთავება',
            'ენერგეტიკა',
            'ინჟინერია',
            'ინფორმაციული ტექნოლოგიები',
            'იურიდიული',
            'კაზინო/აზარტული თამაშები',
            'ლოგისტიკა/ტრანსპორტი',
            'მარკეტინგი, რეკლამა, PR',
            'მეცნიერება/განათლება',
            'საბანკო',
            'საზღვაო/პორტი',
            'სამედიცინო',
            'სამშენებლო, უძრავი ქონება',
            'სასტუმრო/რესტორანი/კვება',
            'საჯარო სამსახური',
            'სილამაზე/ესთეტიკური მედიცინა',
            'სოფლის მეურნეობა',
            'სხვა',
            'ტენდერი/კონკურსი',
            'ტრენინგ-კურსები/სასწავლო პროგრამები',
            'ტურიზმი/გართობის სექტორი',
            'უშიშროება/დაცვა',
            'შესყიდვები',
            'წარმოება/ოპერაციები',
            'ხარისხის კონტროლი, გარემოს დაცვა, უსაფრთხოება',
            'ხელოვნება/მედია',
            'ხელოსანი/შეკეთება/მონტაჟი',
        ];

        foreach($jobs as $job) {
            ModelsJobSeeder::create([
                'name' => $job
            ]);
        }
    }
}
